G = [[1, 2], [1, 3], [1, 4], [1, 6], [4, 5], [4, 6], [5, 6]]
print('Список рёбер для графа G: ', *G)

adjacency_list = {1: [2, 3, 4, 6],
                  2: [1],
                  3: [1],
                  4: [1, 5, 6],
                  5: [4, 6],
                  6: [1, 4, 5]}
print('Список смежности для графа G: ', adjacency_list)

matrix_adj = [[0, 1, 1, 1, 0, 1],
              [1, 0, 0, 0, 0, 0],
              [1, 0, 0, 0, 0, 0],
              [1, 0, 0, 0, 1, 1],
              [0, 0, 0, 1, 0, 1],
              [1, 0, 0, 1, 1, 0]]
print('Матрица смежности для графа G: ')
print('\n'.join([' '.join(map(str, row)) for row in matrix_adj]))

matrix_in = [[1, 1, 1, 1, 0, 0, 0],
             [1, 0, 0, 0, 0, 0, 0],
             [0, 1, 0, 0, 0, 0, 0],
             [0, 0, 1, 0, 1, 1, 0],
             [0, 0, 0, 0, 1, 0, 1],
             [0, 0, 0, 1, 0, 1, 1]]
print('Матрица инцидентности для графа G: ')
print('\n'.join([' '.join(map(str, row)) for row in matrix_in]))

